# Задание №2. Задача №2
# completed
# Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N в виде списка.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# 4 -> [1, 2, 6, 24]
# 6 -> [1, 2, 6, 24, 120, 720]
#
#
def composition (n):
    p = 1
    for i in range(n):
        i = i + 1
        p = i * p
        print (p, end=" ")
    
n = int(input('Введите целое число '))
comp = composition (n)
