# Задание № 2. Задача № 1 Вариант №1 
# completed

# Напишите программу, которая принимает на вход
# вещественное число и показывает сумму его цифр.
# Без работы с методами строк.
# in -> out
# 6782 -> 23
# 0.67 -> 13
# 198.45 -> 27
# 
#

def summa(n):
    sum = 0
    n=abs (n)
    while n > 0:
        digit = n % 10
        sum = sum + digit
        n = n // 10
    return sum 
#

x = float(input('Введите вещественное число не более 2-х знаков после десятичной (.) '))
integ_num = float(x)//1          # нахождение целой части числа
sum1 = summa(int(integ_num))     # обращение к методу нахождения суммы целой части
fract_num =abs(x)-abs(integ_num) # нахождение  дробной части числа
fract_num = round(fract_num, 3)  # округление 
integ_fract_num = int(fract_num *100) # приведение дробной части в целое число
sum2 = summa(integ_fract_num)    # обращение к методу нахождения суммы дробной части
sum = sum1 + sum2
print(f'Сумма цифр в числе  {x} равна {sum}') 
